In [1]:
from viewser.operations import fetch
from viewser import Queryset, Column

#some extra functions for some of the later demonstration
import pandas as pd
import numpy as np
import subprocess

import statsmodels.api as sm
import statsmodels.formula.api as smf

from sklearn.metrics import r2_score, mean_squared_error
import matplotlib.pyplot as plt

In [5]:
test_query = (Queryset('test','country_month')
    .with_column(Column('wdi_sh_dyn_mort_fe', from_table="wdi_cy", from_column="wdi_sh_dyn_mort_fe")
    .transform.missing.fill()
    .transform.ops.ln()
    .transform.missing.replace_na()))

In [8]:
df = test_query.publish().fetch()

 .

In [13]:
df.loc[df.index.get_level_values('country_id') == 181]

                     wdi_sh_dyn_mort_fe
month_id country_id
1        181                   4.087656
2        181                   4.087656
3        181                   4.087656
4        181                   4.087656
5        181                   4.087656
...                                 ...
848      181                   2.995732
849      181                   2.995732
850      181                   2.995732
851      181                   2.995732
852      181                   2.995732

[852 rows x 1 columns]